dict_mon = {1:"зима", 2:"зима", 3:"весна", 4:"весна", 5:"весна", 6:"лето", \
            7:"лето", 8:"лето", 9:"осень", 10:"осень", 11:"осень", 12:"зима"}

list_mon = ["зима", "весна", "лето", "осень"]

mon = abs(int(input("Введите номер месяца от 1 до 12:")))
if mon > 12 or mon < 1:
    print(f"{mon} за границами допустимых значений")
    exit(0)

print(f"месяц: {mon}")
print(f"время года (словарь): {dict_mon[mon]}")

if mon == 12:   # переносим "декабрь" в начало списка
    mon = 0
print(f"Время года (список): {list_mon[mon // 3]}")
